https://www.hackerrank.com/domains/sql

# Day 1

# Revising the Select Query I

Query all columns for all American cities in the CITY table with populations larger than 100000. The CountryCode for America is USA.

The CITY table is described as follows:

In [ ]:
SELECT * FROM CITY 
WHERE POPULATION > 100000 AND CountryCode = 'USA';

# 오답 사례 : CountryCode == 'USA' // SQL 조건문에서 일치는 = 을 사용.

# Revising the Select Query II

Query the NAME field for all American cities in the CITY table with populations larger than 120000. The CountryCode for America is USA.

The CITY table is described as follows:

In [ ]:
SELECT NAME FROM CITY 
WHERE POPULATION > 120000 AND CountryCode = 'USA';

# Select All

Query all columns (attributes) for every row in the CITY table.

The CITY table is described as follows:

In [ ]:
SELECT * FROM CITY

# Select By ID

Query all columns for a city in CITY with the ID 1661.

The CITY table is described as follows:

In [ ]:
SELECT * FROM CITY
WHERE ID = '1661';

SELECT * FROM CITY
WHERE ID = 1661;

# Japanese Cities' Attributes



Query all attributes of every Japanese city in the CITY table. The COUNTRYCODE for Japan is JPN.

The CITY table is described as follows:

In [ ]:
SELECT * FROM CITY 
WHERE COUNTRYCODE = 'JPN';

# Japanese Cities' Names

Query the names of all the Japanese cities in the CITY table. The COUNTRYCODE for Japan is JPN.
The CITY table is described as follows:

In [ ]:
SELECT NAME FROM CITY
WHERE COUNTRYCODE = 'JPN';

# Weather Observation Station 1

Query a list of CITY and STATE from the STATION table.
The STATION table is described as follows:

In [ ]:
SELECT CITY, STATE FROM STATION
SELECT CITY, STATE FROM STATION;

# 오답 : SELECT CITY AND STATE FROM STATION;

# Weather Observation Station 3

Query a list of CITY names from STATION for cities that have an even ID number. Print the results in any order, but exclude duplicates from the answer.
The STATION table is described as follows:

In [ ]:
SELECT DISTINCT CITY FROM STATION
WHERE ID%2 = 0;

# https://www.databasejournal.com/features/mysql/article.php/3911786/Eliminating-Duplicate-Rows-from-MySQL-Result-Sets.htm
# DISTINCT : EXCLUDE DUPLICATES

# (HARD) Weather Observation Station 5

Query the two cities in STATION with the shortest and longest CITY names, as well as their respective lengths (i.e.: number of characters in the name). If there is more than one smallest or largest city, choose the one that comes first when ordered alphabetically.
The STATION table is described as follows:

When ordered alphabetically, the CITY names are listed as ABC, DEF, PQRS, and WXY, with lengths  and . The longest name is PQRS, but there are  options for shortest named city. Choose ABC, because it comes first alphabetically.

In [ ]:
# 다른 유저 정답
select city, length(city) from station
order by length(city),city asc
limit 1;

select city, length(city) from station
order by length(city) desc
limit 1;
# --------------- # ---------------

# 도시와 도시 글자 개수를 리턴 받는데
# 도시 글자 개수가 최대인것. 그리고 ASC 순서.
SELECT CITY, CHAR_LENGTH(CITY) FROM STATION 
where CHAR_LENGTH(city) = (select max(CHAR_LENGTH(city)) from station)
order by city asc;

# 도시와 도시 글자 개수를 리턴 받는데
# 도시 글자 개수가 최소인것. 그리고 ASC 순서.
# 여러개라서 LIMIT 1
SELECT CITY, CHAR_LENGTH(CITY) FROM STATION 
where CHAR_LENGTH(city) = (select MIN(CHAR_LENGTH(city)) from station)
order by city asc
LIMIT 1;

# [~~로 시작하는 글자 찾기] Weather Observation Station 6

Query the list of CITY names starting with vowels (i.e., a, e, i, o, or u) from STATION. Your result cannot contain duplicates.

Input Format

The STATION table is described as follows:

In [ ]:
# SUBSTR : 1번째 위치에서 1개 글자를 읽는다.
select city from station 
where lower(SUBSTR(city,1,1)) in ('a','e','i','o','u');

# 정규표현식
select DISTINCT city from station where REGEXP_LIKE(city,'^[aeiouAEIOU]');

# Weather Observation Station 7

Query the list of CITY names ending with vowels (a, e, i, o, u) from STATION. Your result cannot contain duplicates.

In [ ]:
# 내 정답
select DISTINCT city from station 
where lower(SUBSTR(city,-1,1)) in ('a','e','i','o','u');

# 다른 사람 정답
SELECT DISTINCT CITY FROM STATION
WHERE REGEXP_LIKE(City, '[aeiouAEIOU]$');

# 정규표현식
# * 해당 문자의 패턴이 가 0개 이상 일치할 경우 
# + 해당 문자의 패턴이 가 1개 이상 일치할 경우 
# ? 앞 문자가 0개이거나 하나 일치할 경우 
# | OR를 사용하기 위한 연산자 
# ^ 문자열이 시작할 경우 
# $ 문자열이 끝날 경우 
# . NULL을 제외한 임의의 한 문자 
# [] 임의의 그룹, [] 안에서의 ^는 일치하지 않음을 의미 
# [1-9] 또는 [a-z]로 범위를 표현 
# {n} 3번만큼 일치시킴 
# {n,} 적어도 n번 이상만큼 일치시킴 
# {n, m} n번 이상일치시키되 m을 초과하지 않음

# Weather Observation Station 8

Query the list of CITY names from STATION which have vowels (i.e., a, e, i, o, and u) as both their first and last characters. Your result cannot contain duplicates.

In [ ]:
SELECT CITY FROM STATION
where lower(SUBSTR(city,-1,1)) in ('a','e','i','o','u')
AND lower(SUBSTR(city,1,1)) in ('a','e','i','o','u');

# Weather Observation Station 9

Query the list of CITY names from STATION that do not start with vowels. Your result cannot contain duplicates.

In [ ]:
SELECT DISTINCT CITY FROM STATION
WHERE lower(SUBSTR(city,1,1)) NOT in ('a','e','i','o','u');

# 정규 표현식
select distinct city from station 
where NOT REGEXP_LIKE(City, '^[aeiouAEIOU]');

# Weather Observation Station 10

Query the list of CITY names from STATION that do not end with vowels. Your result cannot contain duplicates.

In [ ]:
SELECT DISTINCT CITY FROM STATION
WHERE lower(SUBSTR(city,-1,1)) NOT in ('a','e','i','o','u');

# 정규 표현식
select distinct city from station 
where NOT REGEXP_LIKE(City, '[aeiouAEIOU]$');

# Weather Observation Station 11

Query the list of CITY names from STATION that either do not start with vowels or do not end with vowels. Your result cannot contain duplicates.

In [ ]:
SELECT DISTINCT CITY FROM STATION
WHERE lower(SUBSTR(city,-1,1)) NOT in ('a','e','i','o','u')
OR lower(SUBSTR(city,1,1)) NOT in ('a','e','i','o','u');

# 정규
select distinct city from station 
where NOT REGEXP_LIKE(City, '^[aeiouAEIOU]')
OR NOT REGEXP_LIKE(City, '[aeiouAEIOU]$');

# [SUBSTR] Weather Observation Station 12

Query the list of CITY names from STATION that do not start with vowels and do not end with vowels. Your result cannot contain duplicates.

In [ ]:
SELECT DISTINCT CITY FROM STATION
WHERE lower(SUBSTR(city,-1,1)) NOT in ('a','e','i','o','u')
AND lower(SUBSTR(city,1,1)) NOT in ('a','e','i','o','u');

# 정규
select distinct city from station 
where NOT REGEXP_LIKE(City, '^[aeiouAEIOU]')
AND NOT REGEXP_LIKE(City, '[aeiouAEIOU]$');

# [오름차순 나열 Order by] Higher Than 75 Marks

Query the Name of any student in STUDENTS who scored higher than  Marks. Order your output by the last three characters of each name. If two or more students both have names ending in the same last three characters (i.e.: Bobby, Robby, etc.), secondary sort them by ascending ID.

In [ ]:
SELECT NAME FROM STUDENTS
WHERE MARKS > 75
ORDER BY SUBSTR(NAME,-3,3),ID ASC;

# 오답 : SECONDARY SORT 기준 -> ORDER BY SUBSTR(NAME,-3,3),ID ASC;
# SUBSTR 뒤에 ID가 있으면 두번째 기준이 됨.

# [ORDER BY] Employee Names

Write a query that prints a list of employee names (i.e.: the name attribute) from the Employee table in alphabetical order.

In [ ]:
SELECT NAME FROM EMPLOYEE
ORDER BY NAME ASC;

# Employee Salaries

Write a query that prints a list of employee names (i.e.: the name attribute) for employees in Employee having a salary greater than  per month who have been employees for less than  months. Sort your result by ascending employee_id.

In [ ]:
SELECT NAME FROM EMPLOYEE
WHERE SALARY > 2000
AND MONTHS < 10
ORDER BY EMPLOYEE_ID ASC;

# [소수점아래 ~자리 ROUND] Weather Observation Station 17

Query the Western Longitude (LONG_W)where the smallest Northern Latitude (LAT_N) in STATION is greater than . Round your answer to  decimal places.

In [ ]:
SELECT ROUND(LONG_W,4) FROM STATION
WHERE LAT_N IN (SELECT MIN(LAT_N) FROM STATION WHERE LAT_N > 38.7780 );

SELECT ROUND(LONG_W,4) FROM STATION
WHERE LAT_N I= (SELECT MIN(LAT_N) FROM STATION WHERE LAT_N > 38.7780 );

# Weather Observation Station 18

Consider  and  to be two points on a 2D plane.

 happens to equal the minimum value in Northern Latitude (LAT_N in STATION).
 happens to equal the minimum value in Western Longitude (LONG_W in STATION).
 happens to equal the maximum value in Northern Latitude (LAT_N in STATION).
 happens to equal the maximum value in Western Longitude (LONG_W in STATION).
Query the Manhattan Distance between points  and  and round it to a scale of  decimal places.

In [ ]:
# SELECT LAT_N,LONG_W FROM STATION
# WHERE LAT_N = (SELECT MIN(LAT_N) FROM STATION)
# AND LONG_W = (SELECT MIN(LONG_W) FROM STATION)


# SELECT LAT_N FROM STATION
# WHERE LAT_N = (SELECT MIN(LAT_N) FROM STATION)
# # 25.07

# SELECT LONG_W FROM STATION
# AND LONG_W = (SELECT MIN(LONG_W) FROM STATION)
# # 25.10

SELECT ROUND( MAX(lat_n)-MIN(lat_n) + MAX(long_w)-MIN(long_w), 4) FROM Station;

# Day 2

# [조건문 CASE Hard] Type of Triangle

Write a query identifying the type of each record in the TRIANGLES table using its three side lengths. Output one of the following statements for each record in the table:

Equilateral: It's a triangle with  sides of equal length.
Isosceles: It's a triangle with  sides of equal length.
Scalene: It's a triangle with  sides of differing lengths.
Not A Triangle: The given values of A, B, and C don't form a triangle.

In [ ]:
select case 
when a=b and b=c and c=a then "Equilateral"
when (a=b and a+b>c) or (c=b and c+b>a) or (c=a and c+a>b) then "Isosceles"
when (a>=b+c or b>=a+c or c>=a+b) then "Not A Triangle"
else "Scalene" # 3개의 길이가 다르고, `가장 짧은거 두개의 합이 가장 긴거보다 길어야 한다는 조건 표현이 길고 어려움`
END
from triangles

# 다른 사람의 답
SELECT CASE             
            WHEN A + B > C AND B + C > A AND A + C > B THEN
                CASE 
                    WHEN A = B AND B = C THEN 'Equilateral'
                    WHEN A = B OR B = C OR A = C THEN 'Isosceles'
                    ELSE 'Scalene'
                END
            ELSE 'Not A Triangle'
        END
FROM TRIANGLES;

# [데이터 개수 : COUNT] Weather Observation Station 4

Find the difference between the total number of CITY entries in the table and the number of distinct CITY entries in the table.
The STATION table is described as follows:

In [ ]:
SELECT (COUNT(CITY)- COUNT(DISTINCT(CITY))) FROM STATION

# Weather Observation Station 14

Query the greatest value of the Northern Latitudes (LAT_N) from STATION that is less than . Truncate your answer to  decimal places.

In [ ]:
SELECT ROUND(MAX(LAT_N),4) FROM STATION
WHERE LAT_N < 137.2345

# Weather Observation Station 15

Query the Western Longitude (LONG_W) for the largest Northern Latitude (LAT_N) in STATION that is less than . Round your answer to  decimal places.

In [ ]:
SELECT ROUND(LONG_W,4) FROM STATION
WHERE LAT_N = (SELECT MAX(LAT_N) FROM STATION WHERE LAT_N < 137.2345)

# Weather Observation Station 16

Query the smallest Northern Latitude (LAT_N) from STATION that is greater than . Round your answer to  decimal places.

In [ ]:
SELECT ROUND(LAT_N,4) FROM STATION
WHERE LAT_N = (SELECT MIN(LAT_N) FROM STATION WHERE LAT_N > 38.7780)

# [SQRT, POW] Weather Observation Station 19

Consider  and  to be two points on a 2D plane where  are the respective minimum and maximum values of Northern Latitude (LAT_N) and  are the respective minimum and maximum values of Western Longitude (LONG_W) in STATION.

Query the Euclidean Distance between points  and  and format your answer to display  decimal digits.

In [ ]:
SELECT ROUND( SQRT( POW( MAX(LONG_W)-MIN(LONG_W),2 ) + POW( MAX(LAT_N)-MIN(LAT_N),2 ) ),4) FROM STATION

# [MEDIAN HARD] Weather Observation Station 20

A median is defined as a number separating the higher half of a data set from the lower half. Query the median of the Northern Latitudes (LAT_N) from STATION and round your answer to  decimal places.

In [ ]:
# MEDIAN 이라는 함수가 없다.

# 홀수인 경우
Select round(S.LAT_N,4) from station S 
where (select count(Lat_N) from station where Lat_N < S.LAT_N ) 
       = (select count(Lat_N) from station where Lat_N > S.LAT_N)

# 짝수인 경우
Select round(AVG(S.LAT_N),4) from station S 
where (select count(Lat_N) from station where Lat_N < S.LAT_N ) 
       = (select count(Lat_N) from station where Lat_N > S.LAT_N)


# 다른 사람의 풀이
select cast(lat_n as decimal(10,4)) from
(select lat_n, row_number() over (order by lat_n desc) as rnum1 from station) t1
where rnum1 = 
(select case when max(rnum)%2=0 then max(rnum)/2
            else max(rnum)/2+1 end 
            from 
(select row_number() over (order by lat_n desc) as rnum from station) t)

# 다른 사람의 풀이2
# https://techblog-history-younghunjo1.tistory.com/160

# Revising Aggregations - The Count Function

Query a count of the number of cities in CITY having a Population larger than .

In [ ]:
SELECT COUNT(ID) FROM CITY
WHERE POPULATION>100000

# [Hard GROUP BY] The PADS

Generate the following two result sets:

Query an alphabetically ordered list of all names in OCCUPATIONS, immediately followed by the first letter of each profession as a parenthetical (i.e.: enclosed in parentheses). For example: AnActorName(A), ADoctorName(D), AProfessorName(P), and ASingerName(S).
Query the number of ocurrences of each occupation in OCCUPATIONS. Sort the occurrences in ascending order, and output them in the following format:

There are a total of [occupation_count] [occupation]s.
where [occupation_count] is the number of occurrences of an occupation in OCCUPATIONS and [occupation] is the lowercase occupation name. If more than one Occupation has the same [occupation_count], they should be ordered alphabetically.

In [ ]:
# concat(Name,'(',Substring(Occupation,1,1),')')
# CONCAT : STR,STR,STR -> STRSTRSTR 
SELECT NAME, CONCAT('(',UPPER(SUBSTR(OCCUPATION,1,1)),')') FROM OCCUPATIONS
ORDER BY NAME ASC;

# Sort the occurrences in ascending order
# If more than one Occupation has the same [occupation_count], 
# they should be ordered alphabetically.

# 나의 오답
SELECT COUNT(OCCUPATION) FROM OCCUPATIONS
WHERE OCCUPATION = (SELECT DISTINCT OCCUPATION FROM OCCUPATIONS)
# ㄴ 이건 서브쿼리가 조회하는 ROW 개수가 2개 이상이라서 에러가 발생

# 다른 사람의 답
select concat('There are total',' ',count(occupation),' ',lower(occupation),'s.') 

from occupations

group by occupation

order by count(occupation), OCCUPATION

# GROUP BY : 유형별로 갯수를 알고 싶을 때는 
# 컬럼에 데이터를 그룹화 할 수 있는 GROUP BY를 사용

# [Hard Pivot] Occupations

Pivot the Occupation column in OCCUPATIONS so that each Name is sorted alphabetically and displayed underneath its corresponding Occupation. The output column headers should be Doctor, Professor, Singer, and Actor, respectively.

Note: Print NULL when there are no more names corresponding to an occupation.

In [ ]:
# 다른 유저 답안
SELECT
    case when Occupation='Doctor' then Name end as Doctor,
    case when Occupation='Professor' then Name end as Professor,
    case when Occupation='Singer' then Name end as Singer,
    case when Occupation='Actor' then Name end as Actor
FROM OCCUPATIONS

# 이렇게 하면 DOCTOR,Professor,... 인 경우 유저 네임만 가져오고 아니면 NULL로 나옴.
# | C1 | C2 | C3 | C4 | 
# NULL Ashley NULL NULL
# NULL NULL NULL Samantha
# Julia NULL NULL NULL
# NULL Britney NULL NULL
set @r1=0, @r2=0, @r3=0, @r4=0;

SELECT case 
    when Occupation='Doctor' then (@r1:=@r1+1)
    when Occupation='Professor' then (@r2:=@r2+1)
    when Occupation='Singer' then (@r3:=@r3+1) 
    when Occupation='Actor' then (@r4:=@r4+1) end as RowNumber

FROM OCCUPATIONS
# 이렇게 하면 직업별로 DOCTOR,Professor,...로 N번째로 존재하는 ROW별 INDEX가 나옴.
# 1 ( ASHLEY : 1 )
# 1 ( SAMANTHA : 1 )
# 1 ( JULIA : 1 )
# 2 ( BRITNEY : 2 )
# 여기서, ASHLEY : 1, SAMANTHA :1, JULIA :1, BRITNEY :2 의 의미는
# 애슐리는 프로페서로 1번째로 조회되고, BRITNEY는 2번째로 조회됨
# 맨 처음 실행한 쿼리랑 섞으면, DB상에 몇번째로, 어떤 직업인지 알 수 있음.

# 섞음
set @r1=0, @r2=0, @r3=0, @r4=0;

SELECT case 
	when Occupation='Doctor' then (@r1:=@r1+1)
        when Occupation='Professor' then (@r2:=@r2+1)
        when Occupation='Singer' then (@r3:=@r3+1)
        when Occupation='Actor' then (@r4:=@r4+1) end as RowNumber,
        case when Occupation='Doctor' then Name end as Doctor,
        case when Occupation='Professor' then Name end as Professor,
        case when Occupation='Singer' then Name end as Singer,
        case when Occupation='Actor' then Name end as Actor

FROM OCCUPATIONS
# 1 NULL Ashley NULL NULL
# 1 NULL NULL NULL Samantha
# 1 Julia NULL NULL NULL
# 2 NULL Britney NULL NULL

# 최종
set @r1=0, @r2=0, @r3=0, @r4=0;
select min(Doctor), min(Professor), min(Singer), min(Actor)
from(
  select case 
    when Occupation='Doctor' then (@r1:=@r1+1)
    when Occupation='Professor' then (@r2:=@r2+1)
    when Occupation='Singer' then (@r3:=@r3+1)
    when Occupation='Actor' then (@r4:=@r4+1) 
  end as RowNumber,
     
         case when Occupation='Doctor' then Name end as Doctor,
         case when Occupation='Professor' then Name end as Professor,
         case when Occupation='Singer' then Name end as Singer,
         case when Occupation='Actor' then Name end as Actor
  from OCCUPATIONS
  order by Name
	) temp
group by RowNumber;

# GROUP BY를 통해서 
# 1 NULL Ashley NULL NULL
# 1 NULL NULL NULL Samantha
# 1 Julia NULL NULL NULL
# 2 NULL Britney NULL NULL
# 여기서 MIN(OCCU)로 1부터 N까지 순차적으로 NAME을 가져옴.

# [NULL이 있는 경우 NOT IN, BST] Binary Tree Nodes

You are given a table, BST, containing two columns: N and P, where N represents the value of a node in Binary Tree, and P is the parent of N.



Write a query to find the node type of Binary Tree ordered by the value of the node. Output one of the following for each node:

Root: If node is root node.
Leaf: If node is leaf node.
Inner: If node is neither root nor leaf node.

In [ ]:
# 해당 노드에 CHILD가 있는지 없는지 판별이 관건이라고 생각됨
# CHILD 가 없다 = PARENT 에는 없지만 N에는 있다.
SELECT DISTINCT N FROM BST
WHERE N NOT IN (SELECT DISTINCT P FROM BST WHERE P IS NOT NULL)
# 결과 : 1,3,5,6,8,10,....
# P 에 NULL이 있는 경우 NOT IN을 하면 항상 UNKNOWN을 리턴함
# https://doorbw.tistory.com/222

# SELECT DISTINCT P FROM BST
# 2,6,4,...13,11,NULL
# SELECT DISTINCT N FROM BST
# 1,2,3,4,....,14,15

# -----------------------------------------------

SELECT N,CASE
WHEN P is null THEN 'Root'
WHEN N IN (
    SELECT DISTINCT N FROM BST
    WHERE N NOT IN (SELECT DISTINCT P FROM BST WHERE P IS NOT NULL)) THEN 'Leaf'
ELSE 'Inner'
END
FROM BST

ORDER BY N
# 정답
# 1 Leaf 
# 2 Inner 
# 3 Leaf 
# 4 Inner 
# 5 Leaf 
# 6 Inner 

# 제출
# 1 Leaf
# 2 Inner
# 3 Leaf
# 4 Inner
# 5 Leaf
# 6 Inner
# 7 Leaf
# 8 Leaf
# 9 Inner
# 10 Leaf
# 11 Inner
# 12 Leaf
# 13 Inner
# 14 Leaf
# 15 Inner

# --------------------------------------------

# 다른 사람 코드
SELECT CASE
	WHEN P IS NULL THEN CONCAT(N, ' Root')
	WHEN N IN (SELECT DISTINCT P FROM BST) THEN CONCAT(N, ' Inner')
	ELSE CONCAT(N, ' Leaf')
	END
FROM BST
ORDER BY N ASC